app/Http/Controllers/User/UserController.php

    public function orders()
    {
        $pageTitle = 'Orders';

        $orders = Order::where('user_id', auth()->id())
            ->where('status', Status::ORDER_PAID)
            ->searchable(['deposit:trx'])
            ->orderBy('id', 'desc')
            ->with('deposit', 'orderItems')
            ->paginate(getPaginate());




        $count_order = Order::where('user_id', Auth::id())->where('status', 1)->count();
        $order_sum = Order::where('user_id', Auth::id())->where('status', 1)->sum('total_amount');
---
select * from `deposits` where `deposits`.`order_id` in (37951, 39792, 40726, 42173, 45027, 46537, 47896, 47900, 51186, 53045, 56362, 56474, 56980, 60626, 62748, 62978, 65343, 66115, 73236, 73309, 73603, 74143, 77822, 79042, 80668, 81202, 81212, 83391, 83441, 83598)
select * from `order_items` where `order_items`.`order_id` in (37951, 39792, 40726, 42173, 45027, 46537, 47896, 47900, 51186, 53045, 56362, 56474, 56980, 60626, 62748, 62978, 65343, 66115, 73236, 73309, 73603, 74143, 77822, 79042, 80668, 81202, 81212, 83391, 83441, 83598)
select * from `orders` where `user_id` = 12920 and `status` = 1 order by `id` desc limit 30 offset 0
select count(*) as aggregate from `orders` where `user_id` = 12920 and `status` = 1
select sum(`total_amount`) as aggregate from `orders` where `user_id` = 12920 and `status` = 1

    public function orderDetails($id)
    {
        $pageTitle = 'Order Details';
        $order = Order::where('user_id', auth()->id())->where('status', Status::ORDER_PAID)->findOrFail($id);
        $orderItems = OrderItem::whereIn('id', $order->orderItems->pluck('id') ?? [])->with('product', 'productDetail')->paginate(getPaginate());
        $orderd = OrderItem::whereIn('id', $order->orderItems->pluck('id') ?? [])->with('productDetail')->get();

        foreach ($orderd as $product)
        {
            $item[] = $product->productDetail->id;
        }

        $update = ProductDetail::whereIn('id', $item)->update(['is_sold'=>Status::YES]);
---
select * from `orders` where `user_id` = 12920 and `status` = 1 and `orders`.`id` = '83598' limit 1
select * from `products` where `products`.`id` in (106)
select count(*) as aggregate from `order_items` where `id` in (122718)
select * from `order_items` where `id` in (122718)
select * from `product_details` where `product_details`.`id` in (203407)
update `product_details` set `is_sold` = 1, `product_details`.`updated_at` = '2025-05-26 16:46:13' where `id` in (203407)