app/Http/Controllers/Gateway/PaymentController.php

    private function processPurchase(Request $request)
    {
        // Validate purchase-specific inputs
        $request->validate([
            'id' => 'required|exists:products,id',
            'qty' => 'required|integer|gt:0',
            'coupon_code' => 'nullable|exists:coupon_codes,coupon_code',
        ]);

        $qty = $request->qty;
        $product = Product::active()->whereHas('category', function($category) {
            return $category->active();
        })->findOrFail($request->id);

        // Calculate available stock dynamically
        $availableStock = ProductDetail::where('product_id', $product->id)
            ->where('is_sold', 0) // 0 means in stock
            ->count();
---
select count(*) as aggregate from `product_details` where `product_id` = 106 and `is_sold` = 0

        }

        // Deduct the amount from the user's balance
        $user->decrement('balance', $amount);
---
update `users` set `balance` = `balance` - 2500, `users`.`updated_at` = '2025-05-26 16:46:04' where `id` = '12920'

        $order->total_amount = $amount;
        $order->name = $product->name;
        $order->status = Status::PAYMENT_SUCCESS; // Mark order as successful
        $order->save();

        // Get unsold product details
        $unsoldProductDetails = ProductDetail::where('product_id', $product->id)
            ->where('is_sold', 0) // 0 means in stock
            ->take($qty)
            ->get();
---
insert into `orders` (`user_id`, `total_amount`, `name`, `status`, `updated_at`, `created_at`) values (12920, 2500, 'TEXPLUS', 1, '2025-05-26 16:46:04', '2025-05-26 16:46:04')
select * from `product_details` where `product_id` = 106 and `is_sold` = 0 limit 1


            // Mark the product detail as sold
            $productDetail->is_sold = 1; // 1 means sold
            $productDetail->save();
---
update `product_details` set `is_sold` = 1, `product_details`.`updated_at` = '2025-05-26 16:46:04' where `id` = '203407'

    private function handleReferralRewards($user, $product, $amount)
    {
        $referrer = Referre::where('refrere', $user->username)->first();
---
select * from `referres` where `refrere` = 'Trustprint' limit 1

    private function notifyPurchase($qty, $product, $amount, $order, $request)
    {
        // Log the purchase
        $br = new Bought();
        $br->user_name = Auth::user()->username;
        $br->qty = $qty;
        $br->item = $product->name;
        $br->amount = $amount;
        $br->save();
---
insert into `boughts` (`user_name`, `qty`, `item`, `amount`, `updated_at`, `created_at`) values ('Trustprint', '1', 'TEXPLUS', 2500, '2025-05-26 16:46:04', '2025-05-26 16:46:04')