app/Http/Controllers/SiteController.php

    public function index(){
        $reference = @$_GET['reference'];
        if ($reference) {
            session()->put('reference', $reference);
        }

        $pageTitle = 'Home';
        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','/')->first();
---
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1

    public function categoryProducts($category = null, $id = 0){


        $chk = Auth::check();
        if($chk == false){
            return redirect('user/login');
        }


        $category = Category::active()->findOrFail($id);
        $pageTitle = $category->name;

        $products = Product::active()
            ->where('category_id', $category->id)
            ->searchable(['name', 'description'])
            ->with('productDetails')
            ->orderBy('id', 'DESC')
        ->paginate(getPaginate());

        $sections = Page::where('tempname',$this->activeTemplate)->where('slug','products')->first();
---
select * from `product_details` where `product_details`.`product_id` in (40, 52, 67, 106)
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'products' limit 1